{
  "global": {
    "token": "Discord token for your bot that you can find at https://discordapp.com/developers/applications",
    "presence": "Discord presence message for the bot to display",
    "presence_type": "Discord presence type from (playing, listening, watching) default: playing",
    "discord_member_count_channel_id": "Discord Channel ID to display a count of members in the discord",
    "discord_member_count_format": "Format for the discord member count, using {count} as a placeholder",
    "log_player_count_updates": "Send player count update notices to admin log channel",
    "debug": "Set the logging level to DEBUG for the locally running app. Equivalent to running with -v"
  },
  "servers": {
    "ip": "IP address of your DayZ server",
    "rcon_port": "RCon port for your DayZ server (may be different from the game port)",
    "rcon_password": "RCon password, found in the BattlEye profile directory in your server files",
    "steam_port": "Steam query port",
    "admin_channel_id": "Discord Channel ID that can send admin RCon commands and where logs are sent",
    "chat_channel_id": "Discord Channel ID where the linked DayZ to Discord chat will take place",
    "chat_ignore_regex": "Pattern that, if matched, will not publish the message to the chat channel",
    "chat_show_connect_disconnect_notices": "Send connect and disconnect notices to chat channel",
    "player_count_channel_id": "Discord Channel ID that will have its name updated to the current player count",
    "player_count_format": "Format for setting the channel name using {players}, {slots}, {queue}, and {time} as placeholders for the values",
    "player_count_update_interval": "Time, in seconds, between player count update queries",
    "log_rcon_messages": "Send all RCon messages to admin log channel",
    "log_rcon_keep_alive": "Send RCon keep alive status messages to admin log channel"
  },
  "scheduled_commands": {
    "command": "RCon command to run with parameters. Also accepts 'safe_shutdown'. See the template for examples",
    "delay": "Only used for 'safe_shutdown'. Specifies the delay in seconds before the shutdown",
    "interval": "Interval in seconds between runs of the command",
    "with_clock": "Whether the interval should be aligned with the clock instead of relative",
    "offset": "Delay in seconds from bot startup to running the command, or offset from midnight if with_clock is true"
  },
  "custom_commands": {
    "enabled": "Whether the command is enabled",
    "channels": "List of channel ids to enable the command for. If not present or empty, command will work in every channel",
    "command": "Regex pattern that, if matched, will trigger the command",
    "response": "Discord embed object as described by https://discord.com/developers/docs/resources/channel#embed-object"
  }
}